In [148]:
# lets start with loading pandas
import pandas as pd

# url of the Table 6. Regional Price Parities by Metropolitan Area, 2017
# from Real Personal Income for States and Metropolitan Areas, 2017
# Persistent link to the current data set landing page at https://www.bea.gov/data/prices-inflation/regional-price-parities-state-and-metro-area
url = 'https://raw.githubusercontent.com/jacek-jonca/jacek-jonca.github.io/master/data/rpp0519.xlsx'

df = pd.read_excel(url, sheet_name='Table 6', header=2)

In [149]:
# lets see how it looks
df.head()

                              Unnamed: 0  All items  Goods Services Unnamed: 4
0                                    NaN        NaN    NaN    Rents      Other
1                         United States1      100.0   99.0    101.8      100.1
2  United States nonmetropolitan portion       87.5   94.2     63.3       93.7
3         Metropolitan Statistical Areas        NaN    NaN      NaN        NaN
4                            Abilene, TX       91.2   97.4     78.7       93.5

In [150]:
# lets clean up a bit, assign column labels from misaligned rows and have the in lower case
df.columns = ['city', 'all', df.columns[2].lower(), df.iloc[0][3].lower(), df.iloc[0][4].lower()]

In [151]:
# now it looks much better
df.head()

                                    city    all  goods  rents  other
0                                    NaN    NaN    NaN  Rents  Other
1                         United States1  100.0   99.0  101.8  100.1
2  United States nonmetropolitan portion   87.5   94.2   63.3   93.7
3         Metropolitan Statistical Areas    NaN    NaN    NaN    NaN
4                            Abilene, TX   91.2   97.4   78.7   93.5

In [152]:
# and the bottom looks like this
df.tail(8)

,city,all,goods,rents,other
385,"Yuba City, CA",96.6,95.0,92.9,101.5
386,"Yuma, AZ",90.5,95.0,71.1,101.5
387,NaN,NaN,NaN,NaN,NaN
388,Maximum,130.9,115.6,218.4,117.7
389,Minimum,75.3,91.3,48.5,89.6
390,Range,55.6,24.3,169.9,28.1
391,Source: U.S. Bureau of Economic Analysis,NaN,NaN,NaN,NaN
392,1. The U.S. all items RPP is the average price...,NaN,NaN,NaN,NaN

In [153]:
# the first city in our dataset is Abilene, TX located in row 4 and the last city is Yuma, AZ in row 386
# lets strip the obsolete top 3 rows and anything past row 386, we just want a list of metropolitan areas
df = df[4:387]

In [154]:
# How things look now?
df.head()

                          city    all  goods  rents  other
4                  Abilene, TX   91.2   97.4   78.7   93.5
5                    Akron, OH   90.4   95.8   77.4   91.8
6                   Albany, GA   82.7   97.2     54   93.5
7                   Albany, OR   94.6  100.1   87.4   93.4
8  Albany-Schenectady-Troy, NY  100.6   98.1  103.4  101.8

In [155]:
# since we deleted rows lets renumber dataset so it starts from 0 and not from 4
df = df.reset_index(drop=True)

In [156]:
# now we start from zero, literally ;-)
df.head()

                          city    all  goods  rents  other
0                  Abilene, TX   91.2   97.4   78.7   93.5
1                    Akron, OH   90.4   95.8   77.4   91.8
2                   Albany, GA   82.7   97.2     54   93.5
3                   Albany, OR   94.6  100.1   87.4   93.4
4  Albany-Schenectady-Troy, NY  100.6   98.1  103.4  101.8

In [158]:
# Where do you live?
originCity = input("Where do you live now? Enter city name only.\n\n")
print("\nI understand that you live in ", originCity, ". Let me quickly pull up data about", originCity,".")

df[df['city'].str.contains(originCity)]

Where do you live now? Enter city name only.

Lubbock

Okay, we got that you live in  Lubbock . Let me quickly pull up data about Lubbock .

            city   all  goods rents other
212  Lubbock, TX  93.3   97.8  85.5  93.5

In [177]:
#lets also save this data
originCityCost = df[df['city'].str.contains(originCity)]

In [160]:
# Where would you like to move?
destinationCity = input("What city would you like to move to? (e.g. Dallas, TX)\n\n")
print("\nLet me quickly pull up data about", destinationCity,".")

df[df['city'].str.contains(destinationCity)]

What city would you like to move to? (e.g. Dallas, TX)

Austin

Let me quickly pull up data about Austin .

                     city    all  goods  rents other
21  Austin-Round Rock, TX  100.5   98.1  119.4  93.5

In [179]:
#lets also save this data
destinationCityCost = df[df['city'].str.contains(destinationCity)]

In [191]:
#Get current salary data
currentSalary = input("What is your current salary?\n\n")

#lets sanitize it a bit just in case
currentSalary = currentSalary.replace(',','')
currentSalary = currentSalary.replace('$','')
currentSalary = currentSalary.replace('USD','')
currentSalary = currentSalary.replace(' ','')

# lets make it into an integer
currentSalary = int(currentSalary)

What is your current salary?

$85,000

In [194]:
# Because of the way numbers are internally represented in Python rounding does not always work as you would expect
# We will instead use a custom rounding function from https://stackoverflow.com/questions/31818050/round-number-to-nearest-integer

def proper_round(num, dec=0):
    num = str(num)[:str(num).index('.')+dec+2]
    if num[-1]>='5':
      a = num[:-2-(not dec)]       # integer part
      b = int(num[-2-(not dec)])+1 # decimal part
      return float(a)+b**(-dec+1) if a and b == 10 else float(a+str(b))
    return float(num[:-1])

In [198]:
# Let's calculate equivalent salary in the destination city
destinationFactor = (float(destinationCityCost['all']) / float(originCityCost['all']))
equivalentSalary = currentSalary * destinationFactor

# round it and convert to an integer
equivalentSalary = int(proper_round(equivalentSalary))

In [199]:
#lets print what you would need to make and have it formatted to a comma currency format.
print("You would need to make ${:0,.0f} in".format(equivalentSalary), destinationCity, "in order to maintain the same standard of living.")

You would need to make $91,559 in Austin in order to maintain the same standard of living.